[
  {
    "id": 1,
    "comment": "When looking for a logo designer the toughest part is to convey to the designer a vision and then have them turn that vision into something workable. Not only did Iliyan create something workable but something extremely professional and brandable. He designed a logo and then explained how the design fit my vision. This I have NEVER seen and appreciate it 1000% .",
    "signature": "C. Edwards / Canada"
  },
  {
    "id": 2,
    "comment": "I chose Iliyan because of all the applicants, he stood out as someone who takes pride in his work. And now that the job is complete, I am a 100% satisfied customer. Iliyan spare no effort in ensuring he hears my thought, and then uses his expertise to enhance my requirements.",
    "signature": "J. Ong / Singapore"
  },
  {
    "id": 3,
    "comment": "I have enjoyed working with Iliyan, he was very helpful in providing constructive feedback for the project.He was also accommodating with a positive attitude when changes needed to be made. I will be happy to use him again for any future work. Thank you, a job well done.",
    "signature": "S. Jones / Australia"
  },
  {
    "id": 4,
    "comment": "As one we have also worked with previously, Iliyan is a very trustworthy and talented designer. One of his main strengths are listening to and analysing what the client needs and then delivering it above and beyond what could be expected.  Iliyan is easy to work with and has a great understanding for open communication. He is definitively the person to use, and we will probably be a repeat customer in the future as well! Talent cannot be trained, and Iliyan is great at what he does!",
    "signature": "M. Mathisen / United Kingdom"
  },
  {
    "id": 5,
    "comment": "Was a pleasure to work with Iliyan. He adhered to the schedules and even went the extra mile when I wanted another concept done by him.  He delivered on all counts, and so I can highly recommend him for his creative savvy, timely manner and great work quality.",
    "signature": "F. Garza / Mexico"
  },
  {
    "id": 6,
    "comment": "Not sure I want to share just how good IIiyan is, otherwise he will become too busy for me :-) Suffice to say that he was a virtual team member for me on this project and responded better than some staff members who share the same office space with me. I'm very pleased with his professionalism and quality of work.",
    "signature": "N. Sonariwo / United States"
  },
  {
    "id": 7,
    "comment": " I highly recommend Iliyan as a great professional to work with. I used him for a logo design and he was extremely good to work with, great at communicating, keen to understand the background of what we wanted and very helpful at all stages.",
    "signature": "S. Hart / New Zealand"
  },
  {
    "id": 8,
    "comment": "He was a true pleasure to work with: friendly, punctual, professional, highly communicative, thoughtful, and is a skillful graphic artist. This being our first engagement, se will absolutely hire Iliyan for larger projects. Thanks, Iliyan.",
    "signature": "G. Goldhirsh / United States"
  },
  {
    "id": 9,
    "comment": "Iliyan was very informative, knowledgeable about design and helpful to the business I work for. We had a rough idea on the logo design we wanted and needed someone with experience to tighten up the shape and form. I am extremely happy with his follow through and communication to get the project completed!",
    "signature": "A. McClure / United States"
  },
  {
    "id": 10,
    "comment": "Iliyan was amazing to work with. Before I hired him he was already asking all the right questions to ensure he understood what I was looking for.  He completed the project fast and I received a great logo for my business. I would use Iliyan again and highly recommend him.",
    "signature": "C. O'Brien / Australia"
  }
]
